In [18]:
import pandas as pd

In [19]:
india_weather = pd.DataFrame({
                              "city":["mumbai", "delhi", "banglore"],
                              "temperature":[32,45,30],
                              "humidity": [80,60,78]
                            })

In [20]:
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [21]:
us_weather = pd.DataFrame({
                              "city":["new york", "chicago", "orlando"],
                              "temperature":[21,14,35],
                              "humidity": [68,65,75]
                            })

In [22]:
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [23]:
pd.concat([india_weather, us_weather])

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [25]:
pd.concat([india_weather, us_weather], ignore_index = True)

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [26]:
pd.concat([india_weather, us_weather], keys=["india", "us"])

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [27]:
df  =pd.concat([india_weather, us_weather], keys=["india", "us"])

In [28]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [47]:
temperature_df = pd.DataFrame({
    "city":["mumbai", "delhi", "bangalore"],
    "temperature": [32,45,30],
}, index=[0,1,2])

In [48]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [50]:
windspeed_df = pd.DataFrame({
    "city":["delhi", "mumbai"],
    "temperature": [7,12]
}, index=[1,0])

In [51]:
windspeed_df

     city  temperature
1   delhi            7
0  mumbai           12

In [52]:
pd.concat([temperature_df, windspeed_df], axis = 1)

        city  temperature    city  temperature
0     mumbai           32  mumbai         12.0
1      delhi           45   delhi          7.0
2  bangalore           30     NaN          NaN

In [53]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [58]:
s = pd.Series(["Humid", "Dry", "Rain"],name="event")

In [59]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [ ]:
pd.concat([temperature_df,s], axis=1)